app/views/sessions/cart.html.erb

<div class="cart_items"><% session[@user.id]["cart"].each do |item_id, quantity| %>
        <div><% item = Item.find_by_id(item_id) %></div>
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]