app/views/users/orders.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 12]]
SELECT "carts".* FROM "carts" WHERE "carts"."order_id" = ?  [["order_id", 3]]
---
<% @orders.each do |order| %>
    <div class="order_summary"><h3>Order Number: <%= link_to order.order_number, "/orders/#{order.order_number}" %></h3>
    <% order.carts.each do |cart| %>