app/views/orders/new.html.erb

SELECT "locations".* FROM "locations"
---
<h3>Select another location: <%= form_for @location, url:new_order_path, method: :get do |f| %>
      <%= f.collection_select :id, Location.all, :id, :name %>

SELECT "items".* FROM "items" INNER JOIN "menus" ON "items"."id" = "menus"."item_id" WHERE "menus"."location_id" = ?  [["location_id", 1]]
---
  <% end %></h3>
  <div class="new_order"><div class="menu"><% @location.items.each do |item|%>

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
---
    <% session[@user_id]["cart"].each do |item_id, quantity| %>
        <%= pluralize(quantity, Item.find_by_id(item_id).name) %><br>