app/views/orders/show.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."order_number" = ? LIMIT ?  [["order_number", 2020030514402408004], ["LIMIT", 1]]
---
<div class="display_order_page"><h1>Order Number: <%= @order.order_number %></h1>

SELECT "carts".* FROM "carts" WHERE "carts"."order_id" = ?  [["order_id", 11]]
---
<div class="order_items">
    <% @order.carts.each do |cart| %>