app/controllers/locations_controller.rb

    def index
        @user = User.find_by_id(session[:user_id])
        @locations = Location.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "locations".* FROM "locations"