app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "order_number", "location_id", "status", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 4], ["order_number", 2020], ["location_id", 2], ["status", "received"], ["total_price", 5], ["created_at", "2020-03-05 22:38:31.591836"], ["updated_at", "2020-03-05 22:38:31.591836"]]
---
  def create
    user_id = session[:user_id]
    location_id = session[:location_id].to_i
    status = "received"
    total_price = session[user_id]["total"]
    order_number = Time.now.to_s.delete(': -') + user_id.to_s
    @order = Order.create(user_id:user_id,
      location_id:location_id, status:status,
      total_price:total_price, order_number:order_number)