app/controllers/orders_controller.rb

  def new
    @user = User.find_by_id(session[:user_id])
    if params[:location]
      if params[:location][:id] != session[:location_id]
        session[:location_id] = params[:location][:id]
        session.delete @user.id
      end
    end
    @location = Location.find_by_id(session[:location_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    order_id = params[:id].to_i
    @order = Order.find_by_id(order_id)
    @order.status = "cancelled"
    @order.save
    redirect_to "/orders/#{@order.order_number}"
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "cancelled"], ["updated_at", "2020-03-05 23:16:37.531728"], ["id", 11]]
SELECT "orders".* FROM "orders" WHERE "orders"."order_number" = ? LIMIT ?  [["order_number", 2020030515015008004], ["LIMIT", 1]]

  def show
    @user = User.find_by_id(session[:user_id])
    @order = Order.find_by(order_number: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."order_number" = ? LIMIT ?  [["order_number", "20200306123142080015"], ["LIMIT", 1]]

  def create
    user_id = session[:user_id]
    location_id = session[:location_id].to_i
    status = "received"
    total_price = session[user_id]["total"]
    order_number = Time.now.to_s.delete(': -') + user_id.to_s
    @order = Order.create(user_id:user_id,
      location_id:location_id, status:status,
      total_price:total_price, order_number:order_number)
    session[user_id]["cart"].each {|item_id, quantity|
      Cart.create(item_id:item_id, quantity:quantity,
      order_id:@order.id)
---
INSERT INTO "orders" ("user_id", "order_number", "location_id", "status", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "carts" ("order_id", "item_id", "quantity") VALUES (?, ?, ?)  [["order_id", 9], ["item_id", 35], ["quantity", 2]]