app/controllers/sessions_controller.rb

  def cart
    if params[:user_id] != session[:user_id].to_s
      redirect_to new_order_path
      flash[:meesage] = "You do not have access to this cart"
    end
    @user = User.find_by_id(params[:user_id].to_i)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def remove
    item_id = params[:item_id]
    user_id = params[:user_id]
    if session[:user_id] == user_id.to_i
      if session[user_id]["cart"][item_id]
        session[user_id]["cart"][item_id] -= 1
      else
        session[user_id]["cart"].delete item_id
      end
      session[user_id]["total"] -= Item.find_by_id(item_id.to_i).price
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def add
    item_id = params[:item_id]
    user_id = params[:user_id]
    if session[:user_id] == user_id.to_i
      session[user_id] ||= {"cart" => {}}
      if session[user_id]["cart"][item_id]
        session[user_id]["cart"][item_id] += 1
      else
        session[user_id]["cart"][item_id] = 1
      end
      session[user_id]["total"] ||= 0.0
      session[user_id]["total"] += Item.find_by_id(item_id.to_i).price
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.find_by(user_name: session_params[:user_name])
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "dsmith"], ["LIMIT", 1]]