app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @user = User.find_by_id(params[:id])

INSERT INTO "users" ("user_name", "password_digest", "first_name", "last_name", "email", "phone_number", "address_line_1", "address_line_2", "city", "state", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$SfBZ.qIYz/RBJ9UcQVnHrOTJ36ZSGTHSsEVVeaEIWWh.z.E3NUqSC"], ["id", 6]]
---
  def update
    @user = User.find_by_id(params[:id])
    @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 13]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def destroy
      User.find_by_id(params[:id]).destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def orders
    @user = User.find_by_id(params[:id])
    @orders = @user.orders