app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 15]]
---
  def destroy
      User.find_by_id(params[:id]).destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def orders
    @user = User.find_by_id(params[:id].to_i)
    @orders = @user.orders